package msn.personal.ruleapp.model;

public class EntityListFactory {
    /*
    Назначение: описывает атомарное правило получения одного набора экземпляров сущностей.
    На выходе отдает множество/список отобранных сущностей.
    Описание масштаба А0 для функции создания списков экземпляров.
    Опции отбора экземпляров:
        - по типу сущности (базовый вход);
        - на вход может быть подан набор экземпляров какого-либо отбора.
        - по способу связи с экземплярами сущности другого типа или такого же типа;
        - по способу связи с набором экземпляров какого-либо отбора;
        - опция расширения набора экземпляров по родству:включать родителей или нет, включать всех предков или нет, включать детей или нет, включать всех потомков или нет.
     */

}
